restaurant/app/Http/Controllers/CityController.php

select * from `cities`
---
    public function index()
    {
        return view('cities/index', [
			'cities' => city::all(),
		]);