restaurant/app/Http/Controllers/CountyController.php

    public function index()
    {
        return view('counties/index', [
			'counties' => County::all(),
            ]);
---
select * from `counties`