restaurant/app/Http/Controllers/RestaurantController.php

select * from `restaurants`
---
    public function index()
    {
        return view('restaurants/index', [
			'restaurants' => Restaurant::all(),
		]);

delete from `restaurants` where `id` = 7
---
    public function update(Request $request, Restaurant $restaurant)
    {
        abort_unless(Auth::check(), 401, 'You have to be logged in as the admin to edit this article.');

        // bail validation if no name is set
		if (!$request->filled('name')) {
			return redirect()->back()->with('warning', 'Please enter a title for the restaurant.');
		}

        // update restaurant with form content
		$restaurant->update([
			'name' => $request->input('name'),
			'address' => $request->input('address'),
			'description' => $request->input('description'),
		]);

        //sync selected tags to restaurant (remove those existing but not present in form reques, add those not existing but present in form request)
        $restaurant->tags()->sync($request->input('tags'));